<!doctype html><html lang=en dir=auto><head><meta charset=utf-8><meta http-equiv=x-ua-compatible content="IE=edge"><meta name=viewport content="width=device-width,initial-scale=1,shrink-to-fit=no"><meta name=robots content="index, follow"><title>Neo4j: 圖資料庫 | AC分享小站</title><meta name=keywords content="database"><meta name=description content="楔子 平常使用的最多的應該是 MySQL 了，但通常不同的資料庫有它的使用情境。
簡單分就是有 SQL 和 NoSQL 系列，就二分法的方式處理。
各種資料庫都有它的好用的地方，像 NoSQL 比較有名的就 Redis (它有硬碟版 SSDB)
資料的結構常常會依據使用情境不同有所適合的資料庫。
今天來分享所謂的「圖型」資料庫，資料庫一開始比較需要掌握的就是「設計的理念」
最具代表性的就是 Neo4j
先來看一下它查詢的語法就比較容易理解他的概念。
MATCH (n {name: 'John'})-[:FRIEND]-(friend) WITH n, count(friend) AS friendsCount WHERE friendsCount > 3 RETURN n, friendsCount 其實可以「感覺」的出來就是用「node」和「relationship」來做為查詢的方式，
在每個「node」的上面有屬性，而不同的屬性可以有「條件」來進行過濾。
node 用 () 來標記，關係用 [] 來表示
特徵 就自然有人問，那這個資料庫的好處在哪?
大家覺的「圖」這種的設計，比較常出現在哪? 答案就是 社群 ，它就是點和線的連結而以。
當有這個想法後，例如我好朋友的朋友有哪些?
MATCH (i {name: 'me'})-[:FRIEND]-(f1:friend)-[:FRIEND]-(f2:friend) RETURN n, f1, f2 i = 我; f1 = 我朋友; f2 = 我朋友的朋友
如果想像用 RDBMS，就要用二層 select 來處理(或使用 sub-query)，"><meta name=author content><link rel=canonical href=https://aryung.github.io/posts/2022-03-05-graph-database/><link crossorigin=anonymous href=/assets/css/stylesheet.min.b4e19c453811e60acfec1f00c15ac2be1c53f6ab90187e684358ce7faaf48bab.css integrity="sha256-tOGcRTgR5grP7B8AwVrCvhxT9quQGH5oQ1jOf6r0i6s=" rel="preload stylesheet" as=style><script defer crossorigin=anonymous src=/assets/js/highlight.min.2840b7fccd34145847db71a290569594bdbdb00047097f75d6495d162f5d7dff.js integrity="sha256-KEC3/M00FFhH23GikFaVlL29sABHCX911kldFi9dff8=" onload=hljs.initHighlightingOnLoad()></script>
<link rel=icon href=https://aryung.github.io/favicon.ico><link rel=icon type=image/png sizes=16x16 href=https://aryung.github.io/favicon-16x16.png><link rel=icon type=image/png sizes=32x32 href=https://aryung.github.io/favicon-32x32.png><link rel=apple-touch-icon href=https://aryung.github.io/apple-touch-icon.png><link rel=mask-icon href=https://aryung.github.io/safari-pinned-tab.svg><meta name=theme-color content="#2e2e33"><meta name=msapplication-TileColor content="#2e2e33"><noscript><style>#theme-toggle,.top-link{display:none}</style><style>@media(prefers-color-scheme:dark){:root{--theme:rgb(29, 30, 32);--entry:rgb(46, 46, 51);--primary:rgb(218, 218, 219);--secondary:rgb(155, 156, 157);--tertiary:rgb(65, 66, 68);--content:rgb(196, 196, 197);--hljs-bg:rgb(46, 46, 51);--code-bg:rgb(55, 56, 62);--border:rgb(51, 51, 51)}.list{background:var(--theme)}.list:not(.dark)::-webkit-scrollbar-track{background:0 0}.list:not(.dark)::-webkit-scrollbar-thumb{border-color:var(--theme)}}</style></noscript><script async src="https://www.googletagmanager.com/gtag/js?id=${G-MEASUREMENT_ID}"></script>
<script>window.dataLayer=window.dataLayer||[];function gtag(){dataLayer.push(arguments)}gtag("js",new Date),gtag("config","${G-MEASUREMENT_ID}")</script><meta property="og:title" content="Neo4j: 圖資料庫"><meta property="og:description" content="楔子 平常使用的最多的應該是 MySQL 了，但通常不同的資料庫有它的使用情境。
簡單分就是有 SQL 和 NoSQL 系列，就二分法的方式處理。
各種資料庫都有它的好用的地方，像 NoSQL 比較有名的就 Redis (它有硬碟版 SSDB)
資料的結構常常會依據使用情境不同有所適合的資料庫。
今天來分享所謂的「圖型」資料庫，資料庫一開始比較需要掌握的就是「設計的理念」
最具代表性的就是 Neo4j
先來看一下它查詢的語法就比較容易理解他的概念。
MATCH (n {name: 'John'})-[:FRIEND]-(friend) WITH n, count(friend) AS friendsCount WHERE friendsCount > 3 RETURN n, friendsCount 其實可以「感覺」的出來就是用「node」和「relationship」來做為查詢的方式，
在每個「node」的上面有屬性，而不同的屬性可以有「條件」來進行過濾。
node 用 () 來標記，關係用 [] 來表示
特徵 就自然有人問，那這個資料庫的好處在哪?
大家覺的「圖」這種的設計，比較常出現在哪? 答案就是 社群 ，它就是點和線的連結而以。
當有這個想法後，例如我好朋友的朋友有哪些?
MATCH (i {name: 'me'})-[:FRIEND]-(f1:friend)-[:FRIEND]-(f2:friend) RETURN n, f1, f2 i = 我; f1 = 我朋友; f2 = 我朋友的朋友
如果想像用 RDBMS，就要用二層 select 來處理(或使用 sub-query)，"><meta property="og:type" content="article"><meta property="og:url" content="https://aryung.github.io/posts/2022-03-05-graph-database/"><meta property="article:section" content="posts"><meta property="article:published_time" content="2022-03-05T18:29:06+08:00"><meta property="article:modified_time" content="2022-03-05T18:29:06+08:00"><meta name=twitter:card content="summary"><meta name=twitter:title content="Neo4j: 圖資料庫"><meta name=twitter:description content="楔子 平常使用的最多的應該是 MySQL 了，但通常不同的資料庫有它的使用情境。
簡單分就是有 SQL 和 NoSQL 系列，就二分法的方式處理。
各種資料庫都有它的好用的地方，像 NoSQL 比較有名的就 Redis (它有硬碟版 SSDB)
資料的結構常常會依據使用情境不同有所適合的資料庫。
今天來分享所謂的「圖型」資料庫，資料庫一開始比較需要掌握的就是「設計的理念」
最具代表性的就是 Neo4j
先來看一下它查詢的語法就比較容易理解他的概念。
MATCH (n {name: 'John'})-[:FRIEND]-(friend) WITH n, count(friend) AS friendsCount WHERE friendsCount > 3 RETURN n, friendsCount 其實可以「感覺」的出來就是用「node」和「relationship」來做為查詢的方式，
在每個「node」的上面有屬性，而不同的屬性可以有「條件」來進行過濾。
node 用 () 來標記，關係用 [] 來表示
特徵 就自然有人問，那這個資料庫的好處在哪?
大家覺的「圖」這種的設計，比較常出現在哪? 答案就是 社群 ，它就是點和線的連結而以。
當有這個想法後，例如我好朋友的朋友有哪些?
MATCH (i {name: 'me'})-[:FRIEND]-(f1:friend)-[:FRIEND]-(f2:friend) RETURN n, f1, f2 i = 我; f1 = 我朋友; f2 = 我朋友的朋友
如果想像用 RDBMS，就要用二層 select 來處理(或使用 sub-query)，"><script type=application/ld+json>{"@context":"https://schema.org","@type":"BreadcrumbList","itemListElement":[{"@type":"ListItem","position":1,"name":"Posts","item":"https://aryung.github.io/posts/"},{"@type":"ListItem","position":2,"name":"Neo4j: 圖資料庫","item":"https://aryung.github.io/posts/2022-03-05-graph-database/"}]}</script><script type=application/ld+json>{"@context":"https://schema.org","@type":"BlogPosting","headline":"Neo4j: 圖資料庫","name":"Neo4j: 圖資料庫","description":"楔子 平常使用的最多的應該是 MySQL 了，但通常不同的資料庫有它的使用情境。\n簡單分就是有 SQL 和 NoSQL 系列，就二分法的方式處理。\n各種資料庫都有它的好用的地方，像 NoSQL 比較有名的就 Redis (它有硬碟版 SSDB)\n資料的結構常常會依據使用情境不同有所適合的資料庫。\n今天來分享所謂的「圖型」資料庫，資料庫一開始比較需要掌握的就是「設計的理念」\n最具代表性的就是 Neo4j\n先來看一下它查詢的語法就比較容易理解他的概念。\nMATCH (n {name: \u0026#39;John\u0026#39;})-[:FRIEND]-(friend) WITH n, count(friend) AS friendsCount WHERE friendsCount \u0026gt; 3 RETURN n, friendsCount 其實可以「感覺」的出來就是用「node」和「relationship」來做為查詢的方式，\n在每個「node」的上面有屬性，而不同的屬性可以有「條件」來進行過濾。\nnode 用 () 來標記，關係用 [] 來表示\n特徵 就自然有人問，那這個資料庫的好處在哪?\n大家覺的「圖」這種的設計，比較常出現在哪? 答案就是 社群 ，它就是點和線的連結而以。\n當有這個想法後，例如我好朋友的朋友有哪些?\nMATCH (i {name: \u0026#39;me\u0026#39;})-[:FRIEND]-(f1:friend)-[:FRIEND]-(f2:friend) RETURN n, f1, f2 i = 我; f1 = 我朋友; f2 = 我朋友的朋友\n如果想像用 RDBMS，就要用二層 select 來處理(或使用 sub-query)，","keywords":["database"],"articleBody":"楔子 平常使用的最多的應該是 MySQL 了，但通常不同的資料庫有它的使用情境。\n簡單分就是有 SQL 和 NoSQL 系列，就二分法的方式處理。\n各種資料庫都有它的好用的地方，像 NoSQL 比較有名的就 Redis (它有硬碟版 SSDB)\n資料的結構常常會依據使用情境不同有所適合的資料庫。\n今天來分享所謂的「圖型」資料庫，資料庫一開始比較需要掌握的就是「設計的理念」\n最具代表性的就是 Neo4j\n先來看一下它查詢的語法就比較容易理解他的概念。\nMATCH (n {name: 'John'})-[:FRIEND]-(friend) WITH n, count(friend) AS friendsCount WHERE friendsCount  3 RETURN n, friendsCount 其實可以「感覺」的出來就是用「node」和「relationship」來做為查詢的方式，\n在每個「node」的上面有屬性，而不同的屬性可以有「條件」來進行過濾。\nnode 用 () 來標記，關係用 [] 來表示\n特徵 就自然有人問，那這個資料庫的好處在哪?\n大家覺的「圖」這種的設計，比較常出現在哪? 答案就是 社群 ，它就是點和線的連結而以。\n當有這個想法後，例如我好朋友的朋友有哪些?\nMATCH (i {name: 'me'})-[:FRIEND]-(f1:friend)-[:FRIEND]-(f2:friend) RETURN n, f1, f2 i = 我; f1 = 我朋友; f2 = 我朋友的朋友\n如果想像用 RDBMS，就要用二層 select 來處理(或使用 sub-query)，\n但在 graph database 的查詢就只要像上面很簡單的一個查詢即可。\n至於效率自然有資料庫的演算法去優化使用，當然用 graph database vs RDBMS 都可以解決問題\n但就閱讀上其實圖型資料庫是好理解的，但其實他複雜的都是「資料庫」的設計問題。\n這個就可以再開一個單位來討論就是了。\n","wordCount":"85","inLanguage":"en","datePublished":"2022-03-05T18:29:06+08:00","dateModified":"2022-03-05T18:29:06+08:00","mainEntityOfPage":{"@type":"WebPage","@id":"https://aryung.github.io/posts/2022-03-05-graph-database/"},"publisher":{"@type":"Organization","name":"AC分享小站","logo":{"@type":"ImageObject","url":"https://aryung.github.io/favicon.ico"}}}</script></head><body id=top><script>localStorage.getItem("pref-theme")==="dark"?document.body.classList.add("dark"):localStorage.getItem("pref-theme")==="light"?document.body.classList.remove("dark"):window.matchMedia("(prefers-color-scheme: dark)").matches&&document.body.classList.add("dark")</script><header class=header><script async src="https://www.googletagmanager.com/gtag/js?id=${G-MEASUREMENT_ID}"></script>
<script>window.dataLayer=window.dataLayer||[];function gtag(){dataLayer.push(arguments)}gtag("js",new Date),gtag("config","${G-MEASUREMENT_ID}")</script><nav class=nav><div class=logo><a href=https://aryung.github.io/ accesskey=h title="AC分享小站 (Alt + H)">AC分享小站</a>
<span class=logo-switches><button id=theme-toggle accesskey=t title="(Alt + T)"><svg id="moon" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentcolor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"><path d="M21 12.79A9 9 0 1111.21 3 7 7 0 0021 12.79z"/></svg><svg id="sun" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentcolor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"><circle cx="12" cy="12" r="5"/><line x1="12" y1="1" x2="12" y2="3"/><line x1="12" y1="21" x2="12" y2="23"/><line x1="4.22" y1="4.22" x2="5.64" y2="5.64"/><line x1="18.36" y1="18.36" x2="19.78" y2="19.78"/><line x1="1" y1="12" x2="3" y2="12"/><line x1="21" y1="12" x2="23" y2="12"/><line x1="4.22" y1="19.78" x2="5.64" y2="18.36"/><line x1="18.36" y1="5.64" x2="19.78" y2="4.22"/></svg></button></span></div><ul id=menu></ul></nav></header><main class=main><article class=post-single><header class=post-header><h1 class=post-title>Neo4j: 圖資料庫</h1><div class=post-meta><span title="2022-03-05 18:29:06 +0800 +0800">March 5, 2022</span></div></header><div class=post-content><h1 id=楔子>楔子<a hidden class=anchor aria-hidden=true href=#楔子>#</a></h1><p>平常使用的最多的應該是 MySQL 了，但通常不同的資料庫有它的使用情境。</p><p>簡單分就是有 <code>SQL</code> 和 <code>NoSQL</code> 系列，就二分法的方式處理。</p><p>各種資料庫都有它的好用的地方，像 NoSQL 比較有名的就 <a href=https://redis.io>Redis</a> (它有硬碟版 <a href=https://ssdb.io>SSDB</a>)</p><p>資料的結構常常會依據使用情境不同有所適合的資料庫。</p><p>今天來分享所謂的「圖型」資料庫，資料庫一開始比較需要掌握的就是「設計的理念」</p><p>最具代表性的就是 <a href=https://neo4j.com>Neo4j</a></p><p>先來看一下它查詢的語法就比較容易理解他的概念。</p><pre tabindex=0><code>MATCH (n {name: &#39;John&#39;})-[:FRIEND]-(friend)
WITH n, count(friend) AS friendsCount
WHERE friendsCount &gt; 3
RETURN n, friendsCount
</code></pre><p>其實可以「感覺」的出來就是用「node」和「relationship」來做為查詢的方式，</p><p>在每個「node」的上面有屬性，而不同的屬性可以有「條件」來進行過濾。</p><p>node 用 () 來標記，關係用 [] 來表示</p><h1 id=特徵>特徵<a hidden class=anchor aria-hidden=true href=#特徵>#</a></h1><p>就自然有人問，那這個資料庫的好處在哪?</p><p>大家覺的「圖」這種的設計，比較常出現在哪? 答案就是 <code>社群</code> ，它就是點和線的連結而以。</p><p>當有這個想法後，例如我好朋友的朋友有哪些?</p><pre tabindex=0><code>MATCH (i {name: &#39;me&#39;})-[:FRIEND]-(f1:friend)-[:FRIEND]-(f2:friend)
RETURN n, f1, f2
</code></pre><p><code>i</code> = 我; <code>f1</code> = 我朋友; <code>f2</code> = 我朋友的朋友</p><p>如果想像用 RDBMS，就要用二層 select 來處理(或使用 sub-query)，</p><p>但在 graph database 的查詢就只要像上面很簡單的一個查詢即可。</p><p>至於效率自然有資料庫的演算法去優化使用，當然用 graph database vs RDBMS 都可以解決問題</p><p>但就閱讀上其實圖型資料庫是好理解的，但其實他複雜的都是「資料庫」的設計問題。</p><p>這個就可以再開一個單位來討論就是了。</p></div><footer class=post-footer><ul class=post-tags><li><a href=https://aryung.github.io/tags/database/>database</a></li></ul></footer></article></main><footer class=footer><span>&copy; 2022 <a href=https://aryung.github.io/>AC分享小站</a></span>
<span>Powered by
<a href=https://gohugo.io/ rel="noopener noreferrer" target=_blank>Hugo</a> &
        <a href=https://git.io/hugopapermod rel=noopener target=_blank>PaperMod</a></span></footer><a href=#top aria-label="go to top" title="Go to Top (Alt + G)" class=top-link id=top-link accesskey=g><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 12 6" fill="currentcolor"><path d="M12 6H0l6-6z"/></svg></a><script>let menu=document.getElementById("menu");menu&&(menu.scrollLeft=localStorage.getItem("menu-scroll-position"),menu.onscroll=function(){localStorage.setItem("menu-scroll-position",menu.scrollLeft)}),document.querySelectorAll('a[href^="#"]').forEach(e=>{e.addEventListener("click",function(t){t.preventDefault();var e=this.getAttribute("href").substr(1);window.matchMedia("(prefers-reduced-motion: reduce)").matches?document.querySelector(`[id='${decodeURIComponent(e)}']`).scrollIntoView():document.querySelector(`[id='${decodeURIComponent(e)}']`).scrollIntoView({behavior:"smooth"}),e==="top"?history.replaceState(null,null," "):history.pushState(null,null,`#${e}`)})})</script><script>var mybutton=document.getElementById("top-link");window.onscroll=function(){document.body.scrollTop>800||document.documentElement.scrollTop>800?(mybutton.style.visibility="visible",mybutton.style.opacity="1"):(mybutton.style.visibility="hidden",mybutton.style.opacity="0")}</script><script>document.getElementById("theme-toggle").addEventListener("click",()=>{document.body.className.includes("dark")?(document.body.classList.remove("dark"),localStorage.setItem("pref-theme","light")):(document.body.classList.add("dark"),localStorage.setItem("pref-theme","dark"))})</script></body></html>